//Необходимо найти "почти-палиндромы"

//Будем считать "почти-палиндромом" такой палиндром, симметрия в котором нарушена не более чем в одном символе. Например:
//acbaa - "почти-палиндром", aabbaa - палиндром , acbeq - не палиндром и не "почти-палиндром".
//


//Входные данные:
//На вход программе сначала подается число N (натуральное).
//Затем следует N непустых строк.


//Выходные данные:
//Программа должна вывести все введенные палиндромы и "почти-палиндромы".


//Example:
//Input:
//5
//Adam aba acbaa abba qwerty

//Output
//aba acbaa abba