//В этой задаче необходимо подсчитать количество вхождений подстроки в основную строку.

//Дано:
//На вход вашей программе через стандартный поток ввода подается строка (cin >> ....) (пробельных символов в исходной строке нет)
//Затем, на вход программе так же через стандартный поток ввода подается подстрока.
//Задача: в случае, если подстрока найдена в строке - вывести в консоль количество повторов подстроки в строке.
// в случае отсутсвия - вывести "Not found"

//Example1:
//Input:
// Super_kek_inside_us!We_should_found_this_kek_!
// _kek_

//Output:
// 2

//Example2:
//Input:
//This_is_non-empty_message
// not

//Output:
// Not found


